package subject.freeCode;
/* Создать массив типа String с размером 7.
Записать в него значения дней недели.
Вывести на консоль значение последнего элемента. */

public class Task2 {
    public static void main(String[] args) {
        String[] array = {"Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"};
        System.out.println(array[6]);
    }
}
